#include<iostream>

using namespace std;

void main()
{
	
}

// 위 내용들은 프로그래밍 하기 전 꼭 입력해야 하는 사항들이므로 외워둘 것

// 초록 글자 > 주석, 프로그램에 아무런 영향을 끼치지 않음
// iostream > input, output에 대한 stream 정보를 담고 있는 곳
// 모든 프로그램은 main이라는 실행점을 찾아서 실행함

/* 프로그래밍을 어느 정도 마스터하기까지는 Visual Studio를 사용함, 그런고로 알고 있으면 좋은 단축어
	Ctrl + Space > 인텔리전스 불러오기 (ex. pri 누른 상태로 불러오면 pri가 들어가는 인텔리전스가 쭉 뜸)
	드래그 한 상태 + (Ctrl + K) + C : 주석
	드래그 한 상태 + (Ctrl + K) + U : 주석 풀기
	Ctrl + Shift + F : 검색
	Ctrl + , : 코드 검색

	Ctrl + F5 : 디버깅 하지 않고 시작
	F5 : 디버깅하고 시작
*/

/* 프로그래밍 할 때 꼭 지켜야 하는 내용 (C++)
	괄호가 시작하면 괄호를 닫아줘야 함, 안에 무슨 내용이 들어가든 관계 없이 반드시 괄호는 쌍으로 (ex, (){}[]''"" 등)
	괄호 안에 괄호 가능, 괄호 사이에 괄호 불가능 (ex. [{()}] 가능, {(}) 불가능
*/